CSI API ETABS v1
cDStChinese_2018.SetOverwrite Method
 Sets the value of a steel design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOverwrite(
	string Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType.Objects
)
Function SetOverwrite (
	Name As String,
	Item As Integer,
	Value As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDStChinese_2018
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOverwrite(Name,
	Item, Value, ItemType)
int SetOverwrite(
	String^ Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetOverwrite :
        Name : string *
        Item : int *
        Value : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
Item
Type: System.Int32
 This is an integer between 1 and 45, inclusive, indicating the overwrite item considered.
Framing Type
Element Type
Seismic Design Grade
Energy Dissipation Member?
Is Transfer Member?
Seismic Magnification Factor
Dual System Magnification Factor
Ignore B/T Check?
Classify Beam as Flexo-Compression Member?
Is Rolled Section?
Is Flange Edge Cut by Gas?
Is Both End Pinned?
Ignore Beam PhiB?
Is Beam Top Loaded?
Consider Deflection?
Live Load Deflection Limit, L/Value
Total Load Deflection Limit, L/Value
Total-Camber Deflection Limit, L/Value
Specified Camber
Net Area to Total Area Ratio
Live Load Reduction Factor
Unbraced Length Ratio (Major)
Unbraced Length Ratio (Minor), Lateral Torsional Buckling
Effective Length Factor (Mue Major)
Effective Length Factor (Mue Minor)
Sway M Amplification Factor (AlphaII Major)
Sway M Amplification Factor (AlphaII Minor)
Axial Stability Coefficient (Phi Major)
Axial Stability Coefficient (Phi Minor)
Flexural Stability Coefficient (Phi_b Major)
Flexural Stability Coefficient (Phi_b Minor)
Moment Coefficient (Beta_m Major)
Moment Coefficient (Beta_m Minor)
Moment Coefficient (Beta_t Major)
Moment Coefficient (Beta_t Minor)
Plasticity Factor (Gamma Major)
Plasticity Factor (Gamma Minor)
Section Influence Coefficient (Eta)
Beam/Column Capacity Factor (Eta)
Slenderness Limit in Compresion (lo/r)
Slenderness Limit in Tension (l/r)
Yield stress, Fy
Allowable Normal Stress, f
Allowable Shear Stress, fv
Consider Fictitious shear?
Value
Type: System.Double
 The value of the considered overwrite item.
 Framing Type
Sway Moment Frame, SMF
Concentrically Braced Frame, CBF
Eccentrically Braced Frame, EBF
NonSway Moment Frame, NMF
 Element Type
Column
Beam
Brace
 Seismic Design Grade
Grade I
Grade II
Grade III
Grade IV
Non Seismic
 Energy Dissipation Member?
0 = No
Any other value = Yes
 Is Transfer Member?
0 = No
Any other value = Yes
 Seismic Magnification Factor
Value > 0
 Dual System Magnification Factor
Value > 0
 Ignore B/T Check?
0 = No
Any other value = Yes
 "Classify Beam as Flexo-Compression Member?"
0 = No
Any other value = Yes
 "Is Rolled Section?"
0 = No
Any other value = Yes
 "Is Flange Edge Cut by Gas?"
0 = No
Any other value = Yes
 "Is Both End Pinned?"
0 = No
Any other value = Yes
 "Ignore Beam PhiB?"
0 = No
Any other value = Yes
 "Is Beam Top Loaded?"
0 = No
Any other value = Yes
 Consider deflection
0 = No
Any other value = Yes
 "Live Load Deflection Limit, L/Value"
Value > 0
 "Total Load Deflection Limit, L/Value"
Value > 0
 "Total-Camber Deflection Limit, L/Value"
Value > 0
 "Specified Camber"
Value > 0
 "Net Area to Total Area Ratio"
Value > 0
 "Live Load Reduction Factor"
Value > 0
 Unbraced Length Ratio (Major)
Value > 0
 Unbraced Length Ratio (Minor), Lateral Torsional Buckling
Value > 0
 Effective Length Factor (Mue Major)
Value > 0
 Effective Length Factor (Mue Minor)
Value > 0
 Sway M Amplification Factor (AlphaII Major)
Value > 0
 Sway M Amplification Factor (AlphaII Minor)
Value > 0
 Axial Stability Coefficient (Phi Major)
Value > 0
 Axial Stability Coefficient (Phi Minor)
Value > 0
 Flexural Stability Coefficient (Phi_b Major)
Value > 0
 Flexural Stability Coefficient (Phi_b Minor)
Value > 0
 Moment Coefficient (Beta_m Major)
Value > 0
 Moment Coefficient (Beta_m Minor)
Value > 0
 Moment Coefficient (Beta_t Major)
Value > 0
 Moment Coefficient (Beta_t Minor)
Value > 0
 Plasticity Factor (Gamma Major)
Value > 0
 Plasticity Factor (Gamma Minor)
Value > 0
 Section Influence Coefficient (Eta)
Value > 0
 Beam/Column Capacity Factor (Eta)
Value > 0
 Slenderness Limit in Compresion (lo/r)
Value > 0
 Slenderness Limit in Tension (l/r)
Value > 0
 Yield stress, Fy
Value > 0
 Allowable Normal Stress, f
Value > 0
 Allowable Shear Stress, fv
Value > 0
 Consider Fictitious shear?
0 = No
Any other value = Yes
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
See Also
Reference
cDStChinese_2018 Interface
ETABSv1 Namespace